In [1]:
people = {
    "first": ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [5]:
df.columns = ['first_name', 'last_name', 'email']

In [6]:
df.columns

Index(['first_name', 'last_name', 'email'], dtype='object')

In [7]:
df.columns = [x.upper() for x in df.columns]

In [8]:
df

  FIRST_NAME LAST_NAME                    EMAIL
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [9]:
df.columns = df.columns.str.replace(' ', '_')

In [14]:
df.rename(columns={'FIRST_NAME' : 'first', 'LAST_NAME' : 'last', 'EMAIL': 'email'}, inplace=True)

In [15]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [17]:
df.loc[2] = ['Amr', 'Alnas', 'amer.live477@gmail.com']

In [18]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2    Amr    Alnas   amer.live477@gmail.com

In [20]:
df.loc[2, ['first', 'last', 'email']] = ['john', 'doe', 'JohnDoe@email.com']

In [21]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   john      doe        JohnDoe@email.com

In [23]:
df.loc[2, 'first'] = 'John'
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      doe        JohnDoe@email.com

In [25]:
df.at[2, 'last'] = 'Doe'
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [27]:
filt = (df['email'] == 'JohnDoe@email.com')
df[filt]['last'] = 'Hi'

/tmp/ipykernel_1111/3059389964.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[filt]['last'] = 'Hi'

In [28]:
filt = (df['email'] == 'JohnDoe@email.com')
df.loc[filt, 'last'] = 'Smith'

In [29]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith        JohnDoe@email.com

In [30]:
def to_lower(email):
    return email.lower()

In [33]:
df['email'] = df['email'].apply(to_lower)

In [34]:
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2   John    Smith        johndoe@email.com

In [35]:
df.apply(len)

first    3
last     3
email    3
dtype: int64

In [37]:
df.apply(len , axis='columns')

0    3
1    3
2    3
dtype: int64

In [38]:
len(df['email'])

3

In [39]:
df.apply(pd.Series.min)

first                      Corey
last                         Doe
email    coreymschafer@gmail.com
dtype: object

In [40]:
df.apply(lambda x : x.min())

first                      Corey
last                         Doe
email    coreymschafer@gmail.com
dtype: object

In [41]:
df.applymap(len)

/tmp/ipykernel_1111/1485728669.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(len)

   first  last  email
0      5     7     23
1      4     3     17
2      4     5     17

In [43]:
df['first'].map({'Corey' : 'Hady', 'Jane': 'Amr'})

0    Hady
1     Amr
2     NaN
Name: first, dtype: object

In [44]:
df['first'].replace({'Corey' : 'Hady', 'Jane': 'Amr'})

0    Hady
1     Amr
2    John
Name: first, dtype: object

In [46]:
df['first'] = df['first'].replace({'Corey' : 'Hady', 'Jane': 'Amr'})

In [48]:
df

  first     last                    email
0  Hady  Schafer  coreymschafer@gmail.com
1   Amr      Doe        janedoe@email.com
2  John    Smith        johndoe@email.com